Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
redshift_subnet_group (expand)" references: [module.vpc.module.vpc.aws_redshift_subnet_group.redshift (expand)]
2021-08-23T20:26:44.175Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.igw_arn (expand)" references: [module.vpc.module.vpc.aws_internet_gateway.this (expand)]
2021-08-23T20:26:44.175Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.public_subnets_ipv6_cidr_blocks (expand)" references: [module.vpc.module.vpc.aws_subnet.public (expand)]
2021-08-23T20:26:44.175Z [DEBUG] ReferenceTransformer: "module.web_sg.var.vpc_id (expand)" references: [module.vpc.output.vpc_id (expand)]
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.175Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table_association.redshift_public (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.redshift_subnets (expand) module.vpc.module.vpc.var.enable_public_redshift (expand) module.vpc.module.vpc.var.redshift_subnets (expand) module.vpc.module.vpc.aws_route_table.redshift (expand) module.vpc.module.vpc.aws_route_table.public (expand) module.vpc.module.vpc.var.single_nat_gateway (expand) module.vpc.module.vpc.var.create_redshift_subnet_route_table (expand) module.vpc.module.vpc.aws_subnet.redshift (expand)]
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.175Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table_association.private (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.private_subnets (expand) module.vpc.module.vpc.var.private_subnets (expand) module.vpc.module.vpc.aws_route_table.private (expand) module.vpc.module.vpc.var.single_nat_gateway (expand) module.vpc.module.vpc.aws_subnet.private (expand)]
2021-08-23T20:26:44.175Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.175Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_nat_gateway.this (expand)" references: [module.vpc.module.vpc.aws_internet_gateway.this (expand) module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.enable_nat_gateway (expand) module.vpc.module.vpc.local.nat_gateway_count (expand) module.vpc.module.vpc.local.nat_gateway_ips (expand) module.vpc.module.vpc.var.single_nat_gateway (expand) module.vpc.module.vpc.var.name (expand) module.vpc.module.vpc.var.azs (expand) module.vpc.module.vpc.var.single_nat_gateway (expand) module.vpc.module.vpc.var.tags (expand) module.vpc.module.vpc.var.nat_gateway_tags (expand) module.vpc.module.vpc.aws_subnet.public (expand) module.vpc.module.vpc.var.single_nat_gateway (expand)]
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.default_security_group_name (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.ingress_cidr_blocks (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.database_subnets_ipv6_cidr_blocks (expand)" references: [module.vpc.module.vpc.aws_subnet.database (expand)]
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.database_network_acl_id (expand)" references: [module.vpc.module.vpc.aws_network_acl.database (expand)]
2021-08-23T20:26:44.176Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.176Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table_association.outpost (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.outpost_subnets (expand) module.vpc.module.vpc.var.outpost_subnets (expand) module.vpc.module.vpc.aws_route_table.private (expand) module.vpc.module.vpc.var.single_nat_gateway (expand) module.vpc.module.vpc.aws_subnet.outpost (expand)]
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.default_vpc_tags (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.flow_log_cloudwatch_log_group_retention_in_days (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.redshift_subnet_tags (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.this_customer_gateway (expand)" references: [module.vpc.module.vpc.aws_customer_gateway.this (expand)]
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_network_acl.intra (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.intra_dedicated_network_acl (expand) module.vpc.module.vpc.var.intra_subnets (expand) module.vpc.module.vpc.aws_subnet.intra (expand) module.vpc.module.vpc.aws_vpc.this (expand) module.vpc.module.vpc.var.intra_subnet_suffix (expand) module.vpc.module.vpc.var.name (expand) module.vpc.module.vpc.var.tags (expand) module.vpc.module.vpc.var.intra_acl_tags (expand)]
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.output.security_group_vpc_id (expand)" references: [module.web_sg.module.security_group.aws_security_group.this (expand) module.web_sg.module.security_group.aws_security_group.this_name_prefix (expand)]
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.database_subnets (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.create_database_internet_gateway_route (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.database_dedicated_network_acl (expand)" references: []
2021-08-23T20:26:44.176Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.default_vpc_default_security_group_id (expand)" references: [module.vpc.module.vpc.aws_default_vpc.this (expand)]
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_network_acl_rule.intra_inbound (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.intra_dedicated_network_acl (expand) module.vpc.module.vpc.var.intra_subnets (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.aws_network_acl.intra (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand) module.vpc.module.vpc.var.intra_inbound_acl_rules (expand)]
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.177Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table_association.elasticache (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.elasticache_subnets (expand) module.vpc.module.vpc.var.elasticache_subnets (expand) module.vpc.module.vpc.aws_route_table.elasticache (expand) module.vpc.module.vpc.aws_route_table.private (expand) module.vpc.module.vpc.var.single_nat_gateway (expand) module.vpc.module.vpc.var.create_elasticache_subnet_route_table (expand) module.vpc.module.vpc.aws_subnet.elasticache (expand)]
2021-08-23T20:26:44.177Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.create_elasticache_subnet_group (expand)" references: []
2021-08-23T20:26:44.177Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.vpc_enable_dns_support (expand)" references: [module.vpc.module.vpc.aws_vpc.this (expand)]
2021-08-23T20:26:44.177Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.vgw_id (expand)" references: [module.vpc.module.vpc.aws_vpn_gateway.this (expand) module.vpc.module.vpc.aws_vpn_gateway_attachment.this (expand)]
2021-08-23T20:26:44.177Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.public_internet_gateway_route_id (expand)" references: [module.vpc.module.vpc.aws_route.public_internet_gateway (expand)]
2021-08-23T20:26:44.177Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.178Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.178Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.178Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.aws_security_group_rule.computed_egress_rules (expand)" references: [module.web_sg.module.security_group.var.create (expand) module.web_sg.module.security_group.var.number_of_computed_egress_rules (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_egress_rules (expand) module.web_sg.module.security_group.var.egress_cidr_blocks (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_egress_rules (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_egress_rules (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_egress_rules (expand) module.web_sg.module.security_group.var.egress_ipv6_cidr_blocks (expand) module.web_sg.module.security_group.var.egress_prefix_list_ids (expand) module.web_sg.module.security_group.local.this_sg_id (expand)]
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.vpn_gateway_az (expand)" references: []
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.vpc.var.private_subnets (expand)" references: []
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.ingress_ipv6_cidr_blocks (expand)" references: []
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.egress_cidr_blocks (expand)" references: []
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_network_acl.database (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.database_dedicated_network_acl (expand) module.vpc.module.vpc.var.database_subnets (expand) module.vpc.module.vpc.aws_subnet.database (expand) module.vpc.module.vpc.aws_vpc.this (expand) module.vpc.module.vpc.var.database_subnet_suffix (expand) module.vpc.module.vpc.var.name (expand) module.vpc.module.vpc.var.tags (expand) module.vpc.module.vpc.var.database_acl_tags (expand)]
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.vpc_id (expand)" references: [module.web_sg.var.vpc_id (expand)]
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.local.flow_log_destination_arn (expand)" references: [module.vpc.module.vpc.local.create_flow_log_cloudwatch_log_group (expand) module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log (expand) module.vpc.module.vpc.var.flow_log_destination_arn (expand)]
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.default_vpc_enable_dns_support (expand)" references: [module.vpc.module.vpc.aws_default_vpc.this (expand)]
2021-08-23T20:26:44.178Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.private_route_table_association_ids (expand)" references: [module.vpc.module.vpc.aws_route_table_association.private (expand)]
2021-08-23T20:26:44.178Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.178Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.178Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.aws_security_group_rule.computed_ingress_with_self (expand)" references: [module.web_sg.module.security_group.var.create (expand) module.web_sg.module.security_group.var.number_of_computed_ingress_with_self (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.local.this_sg_id (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.var.ingress_prefix_list_ids (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand) module.web_sg.module.security_group.var.rules (expand) module.web_sg.module.security_group.var.computed_ingress_with_self (expand)]
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.private_subnet_tags (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.default_security_group_tags (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.redshift_route_table_tags (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.flow_log_cloudwatch_iam_role_arn (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.database_subnet_group_name (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.vpc_ipv6_cidr_block (expand)" references: [module.vpc.module.vpc.aws_vpc.this (expand)]
2021-08-23T20:26:44.179Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.secondary_cidr_blocks (expand) module.vpc.module.vpc.var.secondary_cidr_blocks (expand) module.vpc.module.vpc.var.secondary_cidr_blocks (expand) module.vpc.module.vpc.aws_vpc.this (expand)]
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.create_sg (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.egress_with_source_security_group_id (expand)" references: []
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.redshift_subnet_arns (expand)" references: [module.vpc.module.vpc.aws_subnet.redshift (expand)]
2021-08-23T20:26:44.179Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_internet_gateway.this (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.create_igw (expand) module.vpc.module.vpc.var.public_subnets (expand) module.vpc.module.vpc.local.vpc_id (expand) module.vpc.module.vpc.var.name (expand) module.vpc.module.vpc.var.tags (expand) module.vpc.module.vpc.var.igw_tags (expand)]
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.private_subnet_assign_ipv6_address_on_creation (expand)" references: []
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.default_network_acl_tags (expand)" references: []
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.var.number_of_computed_egress_with_source_security_group_id (expand)" references: []
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.outpost_subnets_ipv6_cidr_blocks (expand)" references: [module.vpc.module.vpc.aws_subnet.outpost (expand)]
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.elasticache_subnet_ipv6_prefixes (expand)" references: []
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.var.enable_nat_gateway (expand)" references: []
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.redshift_subnets_cidr_blocks (expand)" references: [module.vpc.module.vpc.aws_subnet.redshift (expand)]
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.output.public_network_acl_arn (expand)" references: [module.vpc.module.vpc.aws_network_acl.public (expand)]
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_subnet.private (expand)" references: [module.vpc.module.vpc.var.create_vpc (expand) module.vpc.module.vpc.var.private_subnets (expand) module.vpc.module.vpc.var.private_subnets (expand) module.vpc.module.vpc.var.private_subnets (expand) module.vpc.module.vpc.var.private_subnet_assign_ipv6_address_on_creation (expand) module.vpc.module.vpc.var.assign_ipv6_address_on_creation (expand) module.vpc.module.vpc.var.private_subnet_assign_ipv6_address_on_creation (expand) module.vpc.module.vpc.var.azs (expand) module.vpc.module.vpc.var.azs (expand) module.vpc.module.vpc.var.azs (expand) module.vpc.module.vpc.var.azs (expand) module.vpc.module.vpc.local.vpc_id (expand) module.vpc.module.vpc.var.private_subnet_suffix (expand) module.vpc.module.vpc.var.name (expand) module.vpc.module.vpc.var.azs (expand) module.vpc.module.vpc.var.tags (expand) module.vpc.module.vpc.var.private_subnet_tags (expand) module.vpc.module.vpc.var.enable_ipv6 (expand) module.vpc.module.vpc.var.private_subnet_ipv6_prefixes (expand) module.vpc.module.vpc.aws_vpc.this (expand) module.vpc.module.vpc.var.private_subnet_ipv6_prefixes (expand)]
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.redshift_subnet_ipv6_prefixes (expand)" references: []
2021-08-23T20:26:44.180Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.var.create_flow_log_cloudwatch_iam_role (expand)" references: []
2021-08-23T20:26:44.248Z [DEBUG] Starting graph walk: walkPlan
2021-08-23T20:26:44.254Z [DEBUG] created provider logger: level=debug
2021-08-23T20:26:44.254Z [INFO]  provider: configuring client automatic mTLS
2021-08-23T20:26:44.293Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.54.0/linux_amd64/terraform-provider-aws_v3.54.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.54.0/linux_amd64/terraform-provider-aws_v3.54.0_x5]
2021-08-23T20:26:44.294Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.54.0/linux_amd64/terraform-provider-aws_v3.54.0_x5 pid=223
2021-08-23T20:26:44.294Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.54.0/linux_amd64/terraform-provider-aws_v3.54.0_x5
2021-08-23T20:26:44.354Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: configuring server automatic mTLS: timestamp=2021-08-23T20:26:44.353Z
2021-08-23T20:26:44.399Z [DEBUG] provider: using plugin: version=5
2021-08-23T20:26:44.399Z [DEBUG] provider.terraform-provider-aws_v3.54.0_x5: plugin address: address=/tmp/plugin454730034 network=unix timestamp=2021-08-23T20:26:44.399Z
2021-08-23T20:26:44.625Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/aws\"]" changed the config value, but that value is unused
2021-08-23T20:26:44.627Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [INFO] AWS Auth provider used: "EnvProvider": timestamp=2021-08-23T20:26:44.627Z
2021-08-23T20:26:44.627Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2021-08-23T20:26:44.627Z
2021-08-23T20:26:44.628Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: APN/1.0 HashiCorp/1.0 Terraform/1.0.1 (+https://www.terraform.io) terraform-provider-aws/3.54.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go/1.40.20 (go1.16; linux; amd64)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIA4A24L3DT2VK3NG7U/20210823/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=6cd1899156ed5d447d771d71a0b3d3e1b68942f01ba40f19a2891005f48c7741
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20210823T202644Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2021-08-23T20:26:44.628Z
2021-08-23T20:26:44.784Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 
Connection: close
Content-Length: 400
Content-Type: text/xml
Date: Mon, 23 Aug 2021 20:26:43 GMT
Keep-Alive: timeout=5
X-Amzn-Requestid: 9157232f-0fc1-4580-a8e8-d40433093680


-----------------------------------------------------: timestamp=2021-08-23T20:26:44.784Z
2021-08-23T20:26:44.784Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::826438047975:user/jal</Arn>
    <UserId>AIDA4A24L3DTZYLE2RQUZ</UserId>
    <Account>826438047975</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>9157232f-0fc1-4580-a8e8-d40433093680</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2021-08-23T20:26:44.784Z
2021-08-23T20:26:44.785Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2021-08-23T20:26:44.785Z
2021-08-23T20:26:44.786Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: APN/1.0 HashiCorp/1.0 Terraform/1.0.1 (+https://www.terraform.io) terraform-provider-aws/3.54.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go/1.40.20 (go1.16; linux; amd64)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIA4A24L3DT2VK3NG7U/20210823/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=6cd1899156ed5d447d771d71a0b3d3e1b68942f01ba40f19a2891005f48c7741
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20210823T202644Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2021-08-23T20:26:44.786Z
2021-08-23T20:26:44.874Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 
Connection: close
Content-Length: 400
Content-Type: text/xml
Date: Mon, 23 Aug 2021 20:26:44 GMT
Keep-Alive: timeout=5
X-Amzn-Requestid: 65693967-f918-46ed-b50a-ce74f5f84353


-----------------------------------------------------: timestamp=2021-08-23T20:26:44.873Z
2021-08-23T20:26:44.874Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::826438047975:user/jal</Arn>
    <UserId>AIDA4A24L3DTZYLE2RQUZ</UserId>
    <Account>826438047975</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>65693967-f918-46ed-b50a-ce74f5f84353</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2021-08-23T20:26:44.874Z
2021-08-23T20:26:44.877Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:44 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeAccountAttributes Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-east-1.amazonaws.com
User-Agent: APN/1.0 HashiCorp/1.0 Terraform/1.0.1 (+https://www.terraform.io) terraform-provider-aws/3.54.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go/1.40.20 (go1.16; linux; amd64)
Content-Length: 87
Authorization: AWS4-HMAC-SHA256 Credential=AKIA4A24L3DT2VK3NG7U/20210823/us-east-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=d2920a9c78d118d2a5009748685f94f0d9e60d6445863509f4022cf5931d74e9
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20210823T202644Z
Accept-Encoding: gzip

Action=DescribeAccountAttributes&AttributeName.1=supported-platforms&Version=2016-11-15
-----------------------------------------------------: timestamp=2021-08-23T20:26:44.877Z
2021-08-23T20:26:45.146Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:45 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeAccountAttributes Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 
Connection: close
Content-Length: 540
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Mon, 23 Aug 2021 20:26:44 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: e5cb386b-0f0a-4013-b9c1-8022b789c46c


-----------------------------------------------------: timestamp=2021-08-23T20:26:45.146Z
2021-08-23T20:26:45.147Z [INFO]  provider.terraform-provider-aws_v3.54.0_x5: 2021/08/23 20:26:45 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeAccountAttributesResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>e5cb386b-0f0a-4013-b9c1-8022b789c46c</requestId>
    <accountAttributeSet>
        <item>
            <attributeName>supported-platforms</attributeName>
            <attributeValueSet>
                <item>
                    <attributeValue>VPC</attributeValue>
                </item>
            </attributeValueSet>
        </item>
    </accountAttributeSet>
</DescribeAccountAttributesResponse>: timestamp=2021-08-23T20:26:45.147Z
2021-08-23T20:26:45.160Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_vpc.this[0]", instance module.vpc.module.vpc.aws_vpc.this[0]
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.cidr"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.instance_tenancy"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.enable_classiclink"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.enable_dns_hostnames"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.enable_dns_support"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.enable_ipv6"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.enable_classiclink_dns_support"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.160Z [INFO]  ReferenceTransformer: reference not found: "var.vpc_tags"
2021-08-23T20:26:45.161Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_vpc.this[0]" references: []
2021-08-23T20:26:45.161Z [DEBUG] refresh: module.vpc.module.vpc.aws_vpc.this[0]: no state, so not refreshing
2021-08-23T20:26:45.183Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_route_table.public[0]", instance module.vpc.module.vpc.aws_route_table.public[0]
2021-08-23T20:26:45.183Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.183Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.183Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_suffix"
2021-08-23T20:26:45.184Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.184Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.184Z [INFO]  ReferenceTransformer: reference not found: "var.public_route_table_tags"
2021-08-23T20:26:45.184Z [INFO]  ReferenceTransformer: reference not found: "local.vpc_id"
2021-08-23T20:26:45.184Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table.public[0]" references: []
2021-08-23T20:26:45.186Z [DEBUG] refresh: module.vpc.module.vpc.aws_route_table.public[0]: no state, so not refreshing
2021-08-23T20:26:45.194Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_internet_gateway.this[0]", instance module.vpc.module.vpc.aws_internet_gateway.this[0]
2021-08-23T20:26:45.195Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.195Z [INFO]  ReferenceTransformer: reference not found: "var.create_igw"
2021-08-23T20:26:45.195Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.195Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.195Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.196Z [INFO]  ReferenceTransformer: reference not found: "var.igw_tags"
2021-08-23T20:26:45.196Z [INFO]  ReferenceTransformer: reference not found: "local.vpc_id"
2021-08-23T20:26:45.196Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_internet_gateway.this[0]" references: []
2021-08-23T20:26:45.198Z [DEBUG] Resource instance state not found for node "module.web_sg.module.security_group.aws_security_group.this_name_prefix[0]", instance module.web_sg.module.security_group.aws_security_group.this_name_prefix[0]
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.create"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.create_sg"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.use_name_prefix"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.revoke_rules_on_delete"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.vpc_id"
2021-08-23T20:26:45.198Z [INFO]  ReferenceTransformer: reference not found: "var.description"
2021-08-23T20:26:45.198Z [DEBUG] ReferenceTransformer: "module.web_sg.module.security_group.aws_security_group.this_name_prefix[0]" references: []
2021-08-23T20:26:45.203Z [DEBUG] refresh: module.vpc.module.vpc.aws_internet_gateway.this[0]: no state, so not refreshing
2021-08-23T20:26:45.207Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_route_table.private[0]", instance module.vpc.module.vpc.aws_route_table.private[0]
2021-08-23T20:26:45.207Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.207Z [INFO]  ReferenceTransformer: reference not found: "local.max_subnet_length"
2021-08-23T20:26:45.208Z [INFO]  ReferenceTransformer: reference not found: "local.nat_gateway_count"
2021-08-23T20:26:45.208Z [INFO]  ReferenceTransformer: reference not found: "var.single_nat_gateway"
2021-08-23T20:26:45.208Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.208Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_suffix"
2021-08-23T20:26:45.208Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_suffix"
2021-08-23T20:26:45.208Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.209Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.209Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.209Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.209Z [INFO]  ReferenceTransformer: reference not found: "var.private_route_table_tags"
2021-08-23T20:26:45.209Z [INFO]  ReferenceTransformer: reference not found: "local.vpc_id"
2021-08-23T20:26:45.210Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table.private[0]" references: []
2021-08-23T20:26:45.211Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_subnet.public[0]", instance module.vpc.module.vpc.aws_subnet.public[0]
2021-08-23T20:26:45.211Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.211Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.211Z [INFO]  ReferenceTransformer: reference not found: "var.one_nat_gateway_per_az"
2021-08-23T20:26:45.211Z [DEBUG] refresh: module.web_sg.module.security_group.aws_security_group.this_name_prefix[0]: no state, so not refreshing
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.map_public_ip_on_launch"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_assign_ipv6_address_on_creation"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.assign_ipv6_address_on_creation"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_assign_ipv6_address_on_creation"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.212Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_suffix"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_tags"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.enable_ipv6"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_ipv6_prefixes"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnet_ipv6_prefixes"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.213Z [INFO]  ReferenceTransformer: reference not found: "local.vpc_id"
2021-08-23T20:26:45.214Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_subnet.public[0]" references: []
2021-08-23T20:26:45.214Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_subnet.private[0]", instance module.vpc.module.vpc.aws_subnet.private[0]
2021-08-23T20:26:45.214Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.214Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnets"
2021-08-23T20:26:45.214Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnets"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_suffix"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.name"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_tags"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.enable_ipv6"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_ipv6_prefixes"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_ipv6_prefixes"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "local.vpc_id"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_assign_ipv6_address_on_creation"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.assign_ipv6_address_on_creation"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnet_assign_ipv6_address_on_creation"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnets"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.215Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.216Z [INFO]  ReferenceTransformer: reference not found: "var.azs"
2021-08-23T20:26:45.216Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.216Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_subnet.private[0]" references: []
2021-08-23T20:26:45.226Z [DEBUG] refresh: module.vpc.module.vpc.aws_subnet.public[0]: no state, so not refreshing
2021-08-23T20:26:45.227Z [DEBUG] refresh: module.vpc.module.vpc.aws_route_table.private[0]: no state, so not refreshing
2021-08-23T20:26:45.232Z [DEBUG] refresh: module.vpc.module.vpc.aws_subnet.private[0]: no state, so not refreshing
2021-08-23T20:26:45.236Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.module.vpc.aws_subnet.private[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
2021-08-23T20:26:45.259Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_route.public_internet_gateway[0]", instance module.vpc.module.vpc.aws_route.public_internet_gateway[0]
2021-08-23T20:26:45.260Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.260Z [INFO]  ReferenceTransformer: reference not found: "var.create_igw"
2021-08-23T20:26:45.260Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.260Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route.public_internet_gateway[0]" references: []
2021-08-23T20:26:45.277Z [DEBUG] refresh: module.vpc.module.vpc.aws_route.public_internet_gateway[0]: no state, so not refreshing
2021-08-23T20:26:45.286Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_route_table_association.public[0]", instance module.vpc.module.vpc.aws_route_table_association.public[0]
2021-08-23T20:26:45.286Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.286Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.286Z [INFO]  ReferenceTransformer: reference not found: "var.public_subnets"
2021-08-23T20:26:45.287Z [INFO]  ReferenceTransformer: reference not found: "aws_subnet.public"
2021-08-23T20:26:45.287Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.287Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table_association.public[0]" references: []
2021-08-23T20:26:45.289Z [DEBUG] refresh: module.vpc.module.vpc.aws_route_table_association.public[0]: no state, so not refreshing
2021-08-23T20:26:45.299Z [DEBUG] Resource instance state not found for node "module.vpc.module.vpc.aws_route_table_association.private[0]", instance module.vpc.module.vpc.aws_route_table_association.private[0]
2021-08-23T20:26:45.299Z [INFO]  ReferenceTransformer: reference not found: "var.create_vpc"
2021-08-23T20:26:45.299Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnets"
2021-08-23T20:26:45.299Z [INFO]  ReferenceTransformer: reference not found: "var.private_subnets"
2021-08-23T20:26:45.299Z [INFO]  ReferenceTransformer: reference not found: "aws_subnet.private"
2021-08-23T20:26:45.299Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.299Z [INFO]  ReferenceTransformer: reference not found: "aws_route_table.private"
2021-08-23T20:26:45.300Z [INFO]  ReferenceTransformer: reference not found: "var.single_nat_gateway"
2021-08-23T20:26:45.300Z [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-08-23T20:26:45.300Z [DEBUG] ReferenceTransformer: "module.vpc.module.vpc.aws_route_table_association.private[0]" references: []
2021-08-23T20:26:45.301Z [DEBUG] refresh: module.vpc.module.vpc.aws_route_table_association.private[0]: no state, so not refreshing
2021-08-23T20:26:45.310Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-08-23T20:26:45.319Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.54.0/linux_amd64/terraform-provider-aws_v3.54.0_x5 pid=223
2021-08-23T20:26:45.319Z [DEBUG] provider: plugin exited
2021-08-23T20:26:45.320Z [INFO]  backend/local: plan operation completed
2021-08-23T20:26:45.320Z [INFO]  backend/local: writing plan output to: /opt/data/repos/beantownpub/infrastructure/5/development/dev/dev-development.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name" = "main"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-private-us-east-1a"
        }
      + tags_all         = {
          + "Name" = "main-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-public"
        }
      + tags_all         = {
          + "Name" = "main-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-private-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "main-private-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-public-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "main-public-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "main"
        }
      + tags_all                         = {
          + "Name" = "main"
        }
    }

  # module.web_sg.module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for web ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-sg"
        }
      + tags_all               = {
          + "Name" = "web-sg"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /opt/data/repos/beantownpub/infrastructure/5/development/dev/dev-development.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/opt/data/repos/beantownpub/infrastructure/5/development/dev/dev-development.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://bbd93bc43499.ngrok.io/lock?id=beantownpub%252Finfrastructure%252Fdev%252Fdevelopment)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p dev`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
